[
    {
        "contexte": "In the 2021 tournament, Turkey played against Italy on 2021-06-11T21:00:00. The match was refereed by Makkelie with assistant referee Steegstra. The  score was 0 - 3. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 63%, temperature was 24°C, and wind speed was 9 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Wales played against Switzerland on 2021-06-12T15:00:00. The match was refereed by Turpin with assistant referee Danos. The  score was 1 - 1. The match lasted for 90 minutes with an additional 6 minutes of injury time. The humidity was 45%, temperature was 29°C, and wind speed was 23 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Denmark played against Finland on 2021-06-12T18:00:00. The match was refereed by Taylor with assistant referee Beswick. The  score was 0 - 1. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 48%, temperature was 17°C, and wind speed was 32 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Belgium played against Russia on 2021-06-12T21:00:00. The match was refereed by Mateu Lahoz with assistant referee Cebrian Devis. The  score was 3 - 0. The match lasted for 90 minutes with an additional 2 minutes of injury time. The humidity was 23%, temperature was 19°C, and wind speed was 8 km/h."
    },
    {
        "contexte": "In the 2021 tournament, England played against Croatia on 2021-06-13T15:00:00. The match was refereed by Orsato with assistant referee Giallatini. The  score was 1 - 0. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 46%, temperature was 27°C, and wind speed was 11 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Austria played against North Macedonia on 2021-06-13T18:00:00. The match was refereed by Ekberg with assistant referee Culum. The  score was 3 - 1. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 76%, temperature was 19°C, and wind speed was 5 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Netherlands played against Ukraine on 2021-06-13T21:00:00. The match was refereed by Brych with assistant referee Borsch. The  score was 3 - 2. The match lasted for 90 minutes with an additional 6 minutes of injury time. The humidity was 46%, temperature was 23°C, and wind speed was 7 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Scotland played against Czech Republic on 2021-06-14T15:00:00. The match was refereed by Siebert with assistant referee Seidel. The  score was 0 - 2. The match lasted for 45 minutes with an additional 0 minutes of injury time. The humidity was 65%, temperature was 14°C, and wind speed was 26 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Poland played against Slovakia on 2021-06-14T18:00:00. The match was refereed by Hategan with assistant referee Ghinguleac. The  score was 1 - 2. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 41%, temperature was 18°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Spain played against Sweden on 2021-06-14T21:00:00. The match was refereed by Vincic with assistant referee Klancnik. The  score was 0 - 0. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 37%, temperature was 29°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Hungary played against Portugal on 2021-06-15T18:00:00. The match was refereed by Cakir with assistant referee Duran. The  score was 0 - 3. The match lasted for 90 minutes with an additional 6 minutes of injury time. The humidity was 38%, temperature was 26°C, and wind speed was 11 km/h."
    },
    {
        "contexte": "In the 2021 tournament, France played against Germany on 2021-06-15T21:00:00. The match was refereed by del Cerro Grande with assistant referee Yuste. The  score was 1 - 0. The match lasted for 90 minutes with an additional 9 minutes of injury time. The humidity was 61%, temperature was 21°C, and wind speed was 2 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Finland played against Russia on 2021-06-16T15:00:00. The match was refereed by Makkelie with assistant referee Steegstra. The  score was 0 - 1. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 38%, temperature was 19°C, and wind speed was 16 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Turkey played against Wales on 2021-06-16T18:00:00. The match was refereed by Artur Dias with assistant referee Rui Tavares. The  score was 0 - 2. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 61%, temperature was 27°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Italy played against Switzerland on 2021-06-16T21:00:00. The match was refereed by Karasev with assistant referee Demeshko. The  score was 3 - 0. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 69%, temperature was 25°C, and wind speed was 7 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Ukraine played against North Macedonia on 2021-06-17T15:00:00. The match was refereed by NA with assistant referee Belatti. The  score was 2 - 1. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 55%, temperature was 26°C, and wind speed was 10 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Denmark played against Belgium on 2021-06-17T18:00:00. The match was refereed by Kuipers with assistant referee Van Roekel. The  score was 1 - 2. The match lasted for 90 minutes with an additional 6 minutes of injury time. The humidity was 51%, temperature was 26°C, and wind speed was 20 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Netherlands played against Austria on 2021-06-17T21:00:00. The match was refereed by Grinfeld with assistant referee Hassan. The  score was 2 - 0. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 63%, temperature was 25°C, and wind speed was 15 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Sweden played against Slovakia on 2021-06-18T15:00:00. The match was refereed by Siebert with assistant referee Seidel. The  score was 1 - 0. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 32%, temperature was 28°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Croatia played against Czech Republic on 2021-06-18T18:00:00. The match was refereed by del Cerro Grande with assistant referee Yuste. The  score was 1 - 1. The match lasted for 90 minutes with an additional 3 minutes of injury time. The humidity was 38%, temperature was 17°C, and wind speed was 17 km/h."
    },
    {
        "contexte": "In the 2021 tournament, England played against Scotland on 2021-06-18T21:00:00. The match was refereed by Mateu Lahoz with assistant referee Cebrian Devis. The  score was 0 - 0. The match lasted for 90 minutes with an additional 3 minutes of injury time. The humidity was 91%, temperature was 14°C, and wind speed was 22 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Hungary played against France on 2021-06-19T15:00:00. The match was refereed by Oliver with assistant referee Burt. The  score was 1 - 1. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 40%, temperature was 30°C, and wind speed was 9 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Portugal played against Germany on 2021-06-19T18:00:00. The match was refereed by Taylor with assistant referee Beswick. The  score was 2 - 4. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 36%, temperature was 31°C, and wind speed was 6 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Spain played against Poland on 2021-06-19T21:00:00. The match was refereed by Orsato with assistant referee Giallatini. The  score was 1 - 1. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 57%, temperature was 24°C, and wind speed was 13 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Italy played against Wales on 2021-06-20T18:00:00. The match was refereed by Hategan with assistant referee Ghinguleac. The  score was 1 - 0. The match lasted for 90 minutes with an additional 3 minutes of injury time. The humidity was 36%, temperature was 29°C, and wind speed was 10 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Switzerland played against Turkey on 2021-06-20T18:00:00. The match was refereed by Vincic with assistant referee Klancnik. The  score was 3 - 1. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 45%, temperature was 28°C, and wind speed was 10 km/h."
    },
    {
        "contexte": "In the 2021 tournament, North Macedonia played against Netherlands on 2021-06-21T18:00:00. The match was refereed by Kovacs with assistant referee Marinescu. The  score was 0 - 3. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 83%, temperature was 15°C, and wind speed was 22 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Ukraine played against Austria on 2021-06-21T18:00:00. The match was refereed by Cakir with assistant referee Duran. The  score was 0 - 1. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 65%, temperature was 25°C, and wind speed was 5 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Finland played against Belgium on 2021-06-21T21:00:00. The match was refereed by Brych with assistant referee Borsch. The  score was 0 - 2. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 54%, temperature was 29°C, and wind speed was 4 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Russia played against Denmark on 2021-06-21T21:00:00. The match was refereed by Turpin with assistant referee Danos. The  score was 1 - 4. The match lasted for 90 minutes with an additional 3 minutes of injury time. The humidity was 69%, temperature was 18°C, and wind speed was 19 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Croatia played against Scotland on 2021-06-22T21:00:00. The match was refereed by NA with assistant referee Belatti. The  score was 3 - 1. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 51%, temperature was 15°C, and wind speed was 17 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Czech Republic played against England on 2021-06-22T21:00:00. The match was refereed by Artur Dias with assistant referee Rui Tavares. The  score was 0 - 1. The match lasted for 90 minutes with an additional 4 minutes of injury time. The humidity was 55%, temperature was 15°C, and wind speed was 15 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Slovakia played against Spain on 2021-06-23T18:00:00. The match was refereed by Kuipers with assistant referee Van Roekel. The  score was 0 - 5. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 22%, temperature was 30°C, and wind speed was 7 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Sweden played against Poland on 2021-06-23T18:00:00. The match was refereed by Oliver with assistant referee Burt. The  score was 3 - 2. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 32%, temperature was 34°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Germany played against Hungary on 2021-06-23T21:00:00. The match was refereed by Karasev with assistant referee Demeshko. The  score was 2 - 2. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 79%, temperature was 20°C, and wind speed was 14 km/h."
    },
    {
        "contexte": "In the 2021 tournament, Portugal played against France on 2021-06-23T21:00:00. The match was refereed by Mateu Lahoz with assistant referee Cebrian Devis. The  score was 2 - 2. The match lasted for 90 minutes with an additional 6 minutes of injury time. The humidity was 51%, temperature was 30°C, and wind speed was 4 km/h."
    },
    {
        "contexte": "In the eighth finals, Wales played against Denmark on 2021-06-26T18:00:00. The match was refereed by Siebert with assistant referee Seidel. The  score was 0 - 4. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 62%, temperature was 23°C, and wind speed was 14 km/h."
    },
    {
        "contexte": "In the eighth finals, Italy played against Austria on 2021-06-26T21:00:00. The match was refereed by Taylor with assistant referee Beswick. The  score was 2 - 1. The match lasted for 120 minutes with an additional 2 minutes of injury time. The humidity was 60%, temperature was 20°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the eighth finals, Netherlands played against Czech Republic on 2021-06-27T18:00:00. The match was refereed by Karasev with assistant referee Demeshko. The  score was 0 - 2. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 36%, temperature was 31°C, and wind speed was 9 km/h."
    },
    {
        "contexte": "In the eighth finals, Belgium played against Portugal on 2021-06-27T21:00:00. The match was refereed by Brych with assistant referee Borsch. The  score was 1 - 0. The match lasted for 90 minutes with an additional 6 minutes of injury time. The humidity was 27%, temperature was 28°C, and wind speed was 14 km/h."
    },
    {
        "contexte": "In the eighth finals, Croatia played against Spain on 2021-06-28T18:00:00. The match was refereed by Cakir with assistant referee Duran. The  score was 3 - 5. The match lasted for 120 minutes with an additional 2 minutes of injury time. The humidity was 41%, temperature was 26°C, and wind speed was 11 km/h."
    },
    {
        "contexte": "In the eighth finals, France played against Switzerland on 2021-06-28T21:00:00. The match was refereed by NA with assistant referee Belatti. The  score was 3 - 3. The match lasted for 120 minutes with an additional 10 minutes of injury time. The humidity was 70%, temperature was 24°C, and wind speed was 5 km/h."
    },
    {
        "contexte": "In the eighth finals, England played against Germany on 2021-06-29T18:00:00. The match was refereed by Makkelie with assistant referee Steegstra. The  score was 2 - 0. The match lasted for 90 minutes with an additional 5 minutes of injury time. The humidity was 69%, temperature was 16°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the eighth finals, Sweden played against Ukraine on 2021-06-29T21:00:00. The match was refereed by Orsato with assistant referee Giallatini. The  score was 1 - 2. The match lasted for 120 minutes with an additional 5 minutes of injury time. The humidity was 53%, temperature was 22°C, and wind speed was 8 km/h."
    },
    {
        "contexte": "In the quarter finals, Switzerland played against Spain on 2021-07-02T18:00:00. The match was refereed by Oliver with assistant referee Burt. The  score was 1 - 1. The match lasted for 120 minutes with an additional 8 minutes of injury time. The humidity was 34%, temperature was 23°C, and wind speed was 7 km/h."
    },
    {
        "contexte": "In the quarter finals, Belgium played against Italy on 2021-07-02T21:00:00. The match was refereed by Vincic with assistant referee Klancnik. The  score was 1 - 2. The match lasted for 90 minutes with an additional 8 minutes of injury time. The humidity was 58%, temperature was 17°C, and wind speed was 10 km/h."
    },
    {
        "contexte": "In the quarter finals, Czech Republic played against Denmark on 2021-07-03T18:00:00. The match was refereed by Kuipers with assistant referee Van Roekel. The  score was 1 - 2. The match lasted for 90 minutes with an additional 7 minutes of injury time. The humidity was 64%, temperature was 28°C, and wind speed was 14 km/h."
    },
    {
        "contexte": "In the quarter finals, Ukraine played against England on 2021-07-03T21:00:00. The match was refereed by Brych with assistant referee Borsch. The  score was 0 - 4. The match lasted for 90 minutes with an additional 1 minutes of injury time. The humidity was 56%, temperature was 27°C, and wind speed was 12 km/h."
    },
    {
        "contexte": "In the semi finals, Italy played against Spain on 2021-07-06T21:00:00. The match was refereed by Brych with assistant referee Borsch. The  score was 1 - 1. The match lasted for 120 minutes with an additional 7 minutes of injury time. The humidity was 73%, temperature was 15°C, and wind speed was 17 km/h."
    },
    {
        "contexte": "In the semi finals, England played against Denmark on 2021-07-07T21:00:00. The match was refereed by Makkelie with assistant referee Steegstra. The  score was 2 - 1. The match lasted for 120 minutes with an additional 2 minutes of injury time. The humidity was 64%, temperature was 19°C, and wind speed was 17 km/h."
    },
    {
        "contexte": "In the final, Italy played against England on 2021-07-11T21:00:00. The match was refereed by Kuipers with assistant referee Van Roekel. The  score was 1 - 1. The match lasted for 120 minutes with an additional 9 minutes of injury time. The humidity was 68%, temperature was 19°C, and wind speed was 13 km/h."
    }
]